org/roam/video_games.org
:PROPERTIES:
:ID:       acec51e6-a3a8-40a0-a74e-614c2419ef01
:END:
#+title: video-games
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Games
The only winning move is not to play
- [[id:274d4b9e-b898-4eb6-a44e-063e7ed34e89][steam]]
** notes
- engines
  - unreal requires github org signup for source
- GGPO
  - input prediction and rollback
  - rust port of ggrs
    - bevy engine plugin
- [[https://github.com/deepnight/ldtk][2d game map tool]]
- [[https://github.com/DFHack/stonesense][3D isometric viewer for dwarf fortress]]
- https://github.com/00-Evan/shattered-pixel-dungeon roguelike for android
- binding of isaac
  - drop trink/item in first few floors boss/item room for red key peice
  - bomb skull with 'x' to get tele card for after polaroid boss fight
- wow classic
  - ~/script MacroFrameText:Insert("")~
- dark alliance 2
  - max 16 runestones (+5) in non extreme(extreme 176 +15 only for boots/rings/amulets)
one runestone per gem
  - max 10 ranks for feats
  - max *15 multiplier to stats in extreme mode (+60 bonus to 2 stats)
  - Fine           +15% AC       x 1.5 Damage, Remarkable     +30% AC       x 2 Damage, Superior       +45% AC       x 2.5 Damage, Grand          +60% AC       x 3 Damage, Imperial       +75% AC       x 3.5 Damage, Flawless       +90% AC       x 4 Damage,
  - gems
    - melee/ranged/gloves:
      - emerald and ruby make vampirism
      - Jacinth x16 and topaz x 16 for most elemental damage on weapons
      - Moonstone for +1 combat reflexes (attack speed)
      - Pearl for +1 improved crit // cleric gloves
      - Jet for +1 def for each piece of armor worn
    - chest/helm/shield:
      - Emerald +5% magical energy and weight reduction
      - amethyst +5% damage resistance // cleric
      - sapphire +1 power attack // cleric 1 item
      - diamond +3 % ele resistance
      - jet +5 hp
    - ring/amulet/boot:
      - rings/amulets get no bonus from quality
      - Jacinth is +1 strength
      - Jade is +1 const
      - diamond is +1 bless (max 10 ranks)
      - Pearl is +1 wisdom
      - aquamarine is +1 intelligence
      - topaz is +1 dex (armour + ranged)
