docs/video_games.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>video-games</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org3439e52">
<div class="navbar-brand" id="orge715414">
<div class="navbar-item" id="org4fb7d90">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org27a2f9e">
<div class="navbar-start" id="org416ec6d">
<div class="navbar-item" id="orgc3b2140">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org9f2f4b3">

</div>

</div>
</nav>
<div id="outline-container-orgbaa2d26" class="outline-2">
<h2 id="orgbaa2d26">Games</h2>
<div class="outline-text-2" id="text-orgbaa2d26">
<p>
The only winning move is not to play
</p>
<ul class="org-ul">
<li><a href="steam.html#ID-274d4b9e-b898-4eb6-a44e-063e7ed34e89">steam</a></li>
</ul>
</div>
<div id="outline-container-org7d53a12" class="outline-3">
<h3 id="org7d53a12">notes</h3>
<div class="outline-text-3" id="text-org7d53a12">
<ul class="org-ul">
<li>engines
<ul class="org-ul">
<li>unreal requires github org signup for source</li>
</ul></li>
<li>GGPO
<ul class="org-ul">
<li>input prediction and rollback</li>
<li>rust port of ggrs
<ul class="org-ul">
<li>bevy engine plugin</li>
</ul></li>
</ul></li>
<li><a href="https://github.com/deepnight/ldtk">2d game map tool</a></li>
<li><a href="https://github.com/DFHack/stonesense">3D isometric viewer for dwarf fortress</a></li>
<li>binding of isaac
<ul class="org-ul">
<li>drop trink/item in first few floors boss/item room for red key peice</li>
<li>bomb skull with 'x' to get tele card for after polaroid boss fight</li>
</ul></li>
<li>wow classic
<ul class="org-ul">
<li><code>/script MacroFrameText:Insert("")</code></li>
</ul></li>
<li>dark alliance 2
<ul class="org-ul">
<li>max 16 runestones (+5) in non extreme(extreme 176 +15 only for boots/rings/amulets)</li>
</ul></li>
</ul>
<p>
one runestone per gem
</p>
<ul class="org-ul">
<li>max 10 ranks for feats</li>
<li>max *15 multiplier to stats in extreme mode (+60 bonus to 2 stats)</li>
<li>Fine           +15% AC       x 1.5 Damage, Remarkable     +30% AC       x 2 Damage, Superior       +45% AC       x 2.5 Damage, Grand          +60% AC       x 3 Damage, Imperial       +75% AC       x 3.5 Damage, Flawless       +90% AC       x 4 Damage,</li>
<li>gems
<ul class="org-ul">
<li>melee/ranged/gloves:
<ul class="org-ul">
<li>emerald and ruby make vampirism</li>
<li>Jacinth x16 and topaz x 16 for most elemental damage on weapons</li>
<li>Moonstone for +1 combat reflexes (attack speed)</li>
<li>Pearl for +1 improved crit // cleric gloves</li>
<li>Jet for +1 def for each piece of armor worn</li>
</ul></li>
<li>chest/helm/shield:
<ul class="org-ul">
<li>Emerald +5% magical energy and weight reduction</li>
<li>amethyst +5% damage resistance // cleric</li>
<li>sapphire +1 power attack // cleric 1 item</li>
<li>diamond +3 % ele resistance</li>
<li>jet +5 hp</li>
</ul></li>
<li>ring/amulet/boot:
<ul class="org-ul">
<li>rings/amulets get no bonus from quality</li>
<li>Jacinth is +1 strength</li>
<li>Jade is +1 const</li>
<li>diamond is +1 bless (max 10 ranks)</li>
<li>Pearl is +1 wisdom</li>
<li>aquamarine is +1 intelligence</li>
<li>topaz is +1 dex (armour + ranged)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>